{
  "[/E1]": 29006,
  "[/E2]": 29007,
  "[E1:CHARACTER]": 28996,
  "[E1:HOUSE]": 28997,
  "[E1:LOCATION]": 29000,
  "[E1:MAGIC_ITEM]": 28998,
  "[E1:SPELL]": 28999,
  "[E2:CHARACTER]": 29001,
  "[E2:HOUSE]": 29002,
  "[E2:LOCATION]": 29005,
  "[E2:MAGIC_ITEM]": 29003,
  "[E2:SPELL]": 29004
}
