{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "acquires",
    "1": "ally-of",
    "2": "casts",
    "3": "enemy-of",
    "4": "founder-of-house",
    "5": "friend-of",
    "6": "given_to",
    "7": "gives",
    "8": "knows",
    "9": "located_in",
    "10": "member-of-house",
    "11": "mentor-of",
    "12": "no_relation",
    "13": "owns",
    "14": "parent-of",
    "15": "rival-of",
    "16": "sibling-of",
    "17": "student-of",
    "18": "teaches",
    "19": "uses"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "acquires": 0,
    "ally-of": 1,
    "casts": 2,
    "enemy-of": 3,
    "founder-of-house": 4,
    "friend-of": 5,
    "given_to": 6,
    "gives": 7,
    "knows": 8,
    "located_in": 9,
    "member-of-house": 10,
    "mentor-of": 11,
    "no_relation": 12,
    "owns": 13,
    "parent-of": 14,
    "rival-of": 15,
    "sibling-of": 16,
    "student-of": 17,
    "teaches": 18,
    "uses": 19
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29008
}
